Revit 2024 API
FabricationItemFolder.GetItemFiles Method
 Gets the item files in this item folder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public IList<FabricationItemFile> GetItemFiles()
Visual Basic
Public Function GetItemFiles As IList(Of FabricationItemFile)
Visual C++
public:
IList<FabricationItemFile^>^ GetItemFiles()
See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace